[
        {
            "id": "5efd4bda9dfe94a55c24ad5a",
            "nome": "Ada Lovalece",
            "description": "Diva da programação, já descrevia as operações lógicas de uma máquina mais de um século antes de existir o computador como entendemos hoje. Filha do romântico Lord Byron e confinada a uma sociedade que impedia que mulheres estudassem em universidades, Ada apaixonou-se pela matemática -- e era brilhante. Trocou intensamente cartas com Charles Babbage, idealizador da Máquina Analítica, e publicou artigos (assinados somente com suas iniciais) que expandiam as fronteiras do processamento de informação.",
            "url": "https://www.programaria.org/como-ada-lovelace-filha-de-lord-byron-se-tornou-primeira-programadora-mundo/"
        },
        {
            "id": "5efd4c099dfe94a55c24ad5b",
            "nome": "Edith Clarke",
            "description": "Nascida numa comunidade rural de Maryland (EUA), Edith Clarke formou-se em matemática e astronomia em 1908 e depois estudou Engenharia Civil. Interrompeu os estudos para trabalhar como computador humano, mas sua paixão falou mais alto: em 1919 tornou-se a primeira mulher a conquistar um Mestrado no Departamento de Engenharia Elétrica e Ciência da Computação do MIT, tornando-se a primeira engenheira elétrica do país. Dois anos depois registrou sua primeira patente: uma calculadora gráfica, que melhorava os métodos para solucionar problemas de transmissão de energia elétrica. Quando se aposentou, em 1956, era professora da Universidade do Texas, onde foi a primeira mulher a ensinar engenharia. Em 2015 passou a integrar o National Inventors Hall of Fame",
            "url": "https://en.wikipedia.org/wiki/Edith_Clarke"
        },
        {
            "id": "5efd4c439dfe94a55c24ad5c",
            "nome": "Grace Hopper",
            "description": "Foi uma cientista da computação norte americana e Contra-almirante da Marinha dos Estados Unidos. Uma das primeiras programadoras do computador Harvard Mark I em 1944, inventou o primeiro compilador para uma linguagem de programação (que transforma um código de programação em código binário) e foi uma das pessoas que popularizou a ideia de linguagem de programação independente de máquina que levou ao desenvolvimento de COBOL, uma das primeiras linguagens de programação a se aproximar da linguagem humana.",
            "url": "https://en.wikipedia.org/wiki/Grace_Hopper"
          
        },
        {
            "id": "5efd4c649dfe94a55c24ad5d",
            "nome": "Dorothy Johnson Vaughan",
            "description": "Nascida no estado do Missouri, Dorothy Vaughan formou-se em Matemática e ingressou na NACA, agência que viria a se tornar a NASA, em 1943. Especializou-se em computação e seis anos depois chefiou um grupo composto somente por mulheres afro-americanas formadas em matemática. Dominava computação eletrônica, programação e o processo operacional da primeira máquina IBM usada pelo órgao governamental. Aposentou-se em 1971. Sua história é contada no filme 'Estrelas Além do Tempo'",
            "url": "https://en.wikipedia.org/wiki/Dorothy_Vaughan"
        },
        {
            "id": "5efd4c949dfe94a55c24ad5e",
            "nome": "Mary Kennth Keller",
            "description": "Natural de Cleveland, Ohio, Mary Keller foi a primeira mulher a ter um doutorado em ciência da computação nos Estados Unidos, em 1965. Graduou-se em matemática e fez mestrado em matemática e física nos anos 40. Seu doutorado pela Universidade de Wisconsin abordou a construção de algoritmos que faziam diferenciação analítica na expressão algébrica, escrito em CDC FORTRAN 63. Na época de sua graduação, a Universidade de Dartmouth só permitia homens, mas quebrou a regra para que ela pudesse trabalhar no centro de computação. Mais tarde, fundou o Departamento de Ciência da Computação na Clarke College, no estado de Iowa, onde lecionou por 20 anos.",
            "url": "https://en.wikipedia.org/wiki/Mary_Kenneth_Keller"
        
        },
        {
            "id": "5efd4cbf9dfe94a55c24ad5f",
            "nome": "Hedy Lamarr ",
            "description": "Foi uma atriz e inventora austríaca radicada nos Estados Unidos. A sua mais significativa contribuição tecnológica deu-se durante a Segunda Guerra Mundial, tendo sido a sua co-invenção, juntamente com o compositor George Antheil, de um sistema de comunicações para as Forças Armadas dos Estados Unidos que serviu de base para a atual telefonia celular.",
            "url": "https://en.wikipedia.org/wiki/Hedy_Lamarr"

        }

    ]